export default {
  id: 1,
  term: "Vue.js",
  definition:
    "JavaScript-фреймворк для создания пользовательских интерфейсов, основанный на стандартных HTML, CSS и JavaScript. Предоставляет декларативную, компонентно-ориентированную модель программирования, помогающую эффективно разрабатывать пользовательские интерфейсы любой сложности. Отличается высокой производительностью, сравнительно небольшим размером бандла, простотой синтаксиса и поддержкой реактивной модели данных.",
  category: "Фреймворки",
  relations: [
    { term: "Механизмы Vue.js", type: "включает" },
    { term: "Перформанс", type: "влияет на" },
    { term: "Accessibility", type: "поддерживается в" },
    { term: "Типы рендеринга", type: "поддерживает" },
    { term: "Директивы Vue", type: "включает" },
    { term: "Инструменты измерения производительности", type: "использует" }
  ],
  sources: [
    {
      citation: "[1]",
      full: "Introduction | Vue.js. [Электронный ресурс]. - URL: https://vuejs.org/guide/introduction.html (дата обращения: 08.10.2024)."
    },
    {
      citation: "[2]",
      full: "Панцырева О. А. ОСОБЕННОСТИ ИСПОЛЬЗОВАНИЯ ФРЕЙМВОРКА VUE. JS ПРИ СОЗДАНИИ ПОЛЬЗОВАТЕЛЬСКОГО ИНТЕРФЕЙСА //ПРОБЛЕМЫ И ПЕРСПЕКТИВЫ РЕАЛИЗАЦИИ МЕЖДИСЦИПЛИНАРНЫХ ИССЛЕДОВАНИЙ: Сборник статей по итогам Международной научно-практической конференции. - 2023. - С. 152."
    }
  ]
}





